cryviem/choen/stm32OS/ee_files/contrib/StellarisWare/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID0 register.
//
//*****************************************************************************
#define SYSCTL_DID0_VER_M       0x70000000  // DID0 Version
#define SYSCTL_DID0_VER_0       0x00000000  // Initial DID0 register format
                                            // definition for Stellaris(R)
                                            // Sandstorm-class devices
#define SYSCTL_DID0_VER_1       0x10000000  // Second version of the DID0
                                            // register format
#define SYSCTL_DID0_CLASS_M     0x00FF0000  // Device Class
#define SYSCTL_DID0_CLASS_SANDSTORM \
                                0x00000000  // Sandstorm-class Device
#define SYSCTL_DID0_CLASS_FURY  0x00010000  // Stellaris(R) Fury-class devices
#define SYSCTL_DID0_CLASS_DUSTDEVIL \
                                0x00030000  // Stellaris(R) DustDevil-class
                                            // devices
#define SYSCTL_DID0_CLASS_TEMPEST \
                                0x00040000  // Stellaris(R) Tempest-class
                                            // microcontrollers
#define SYSCTL_DID0_CLASS_BLIZZARD \
                                0x00050000  // Stellaris(R) Blizzard-class
                                            // microcontrollers
#define SYSCTL_DID0_CLASS_FIRESTORM \
                                0x00060000  // Stellaris(R) Firestorm-class
                                            // microcontrollers
#define SYSCTL_DID0_MAJ_M       0x0000FF00  // Major Revision
#define SYSCTL_DID0_MAJ_REVA    0x00000000  // Revision A (initial device)
#define SYSCTL_DID0_MAJ_REVB    0x00000100  // Revision B (first base layer
                                            // revision)
#define SYSCTL_DID0_MAJ_REVC    0x00000200  // Revision C (second base layer
                                            // revision)
#define SYSCTL_DID0_MIN_M       0x000000FF  // Minor Revision
#define SYSCTL_DID0_MIN_0       0x00000000  // Initial device, or a major
                                            // revision update
#define SYSCTL_DID0_MIN_1       0x00000001  // First metal layer change
#define SYSCTL_DID0_MIN_2       0x00000002  // Second metal layer change
#define SYSCTL_DID0_MIN_3       0x00000003  // Minor revision 3
#define SYSCTL_DID0_MIN_4       0x00000004  // Minor revision 4
#define SYSCTL_DID0_MIN_5       0x00000005  // Minor revision 5

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID1 register.
//
//*****************************************************************************
#define SYSCTL_DID1_VER_M       0xF0000000  // DID1 Version
#define SYSCTL_DID1_VER_0       0x00000000  // Initial DID1 register format
                                            // definition, indicating a
                                            // Stellaris LM3Snnn device
#define SYSCTL_DID1_VER_1       0x10000000  // Second version of the DID1
                                            // register format
#define SYSCTL_DID1_FAM_M       0x0F000000  // Family
#define SYSCTL_DID1_FAM_STELLARIS \
                                0x00000000  // Stellaris family of
                                            // microcontollers, that is, all
                                            // devices with external part
                                            // numbers starting with LM3S
#define SYSCTL_DID1_PRTNO_M     0x00FF0000  // Part Number
#define SYSCTL_DID1_PRTNO_101   0x00010000  // LM3S101
#define SYSCTL_DID1_PRTNO_102   0x00020000  // LM3S102
#define SYSCTL_DID1_PRTNO_300   0x00190000  // LM3S300
#define SYSCTL_DID1_PRTNO_301   0x00110000  // LM3S301
#define SYSCTL_DID1_PRTNO_308   0x001A0000  // LM3S308
#define SYSCTL_DID1_PRTNO_310   0x00120000  // LM3S310
#define SYSCTL_DID1_PRTNO_315   0x00130000  // LM3S315
#define SYSCTL_DID1_PRTNO_316   0x00140000  // LM3S316
#define SYSCTL_DID1_PRTNO_317   0x00170000  // LM3S317
#define SYSCTL_DID1_PRTNO_328   0x00150000  // LM3S328
#define SYSCTL_DID1_PRTNO_600   0x002A0000  // LM3S600
#define SYSCTL_DID1_PRTNO_601   0x00210000  // LM3S601
#define SYSCTL_DID1_PRTNO_608   0x002B0000  // LM3S608
#define SYSCTL_DID1_PRTNO_610   0x00220000  // LM3S610
#define SYSCTL_DID1_PRTNO_611   0x00230000  // LM3S611
#define SYSCTL_DID1_PRTNO_612   0x00240000  // LM3S612
#define SYSCTL_DID1_PRTNO_613   0x00250000  // LM3S613
#define SYSCTL_DID1_PRTNO_615   0x00260000  // LM3S615
#define SYSCTL_DID1_PRTNO_617   0x00280000  // LM3S617
#define SYSCTL_DID1_PRTNO_618   0x00290000  // LM3S618
#define SYSCTL_DID1_PRTNO_628   0x00270000  // LM3S628
#define SYSCTL_DID1_PRTNO_800   0x00380000  // LM3S800
#define SYSCTL_DID1_PRTNO_801   0x00310000  // LM3S801
#define SYSCTL_DID1_PRTNO_808   0x00390000  // LM3S808
#define SYSCTL_DID1_PRTNO_811   0x00320000  // LM3S811
#define SYSCTL_DID1_PRTNO_812   0x00330000  // LM3S812
#define SYSCTL_DID1_PRTNO_815   0x00340000  // LM3S815
#define SYSCTL_DID1_PRTNO_817   0x00360000  // LM3S817
#define SYSCTL_DID1_PRTNO_818   0x00370000  // LM3S818
#define SYSCTL_DID1_PRTNO_828   0x00350000  // LM3S828
#define SYSCTL_DID1_PRTNO_1110  0x00BF0000  // LM3S1110
#define SYSCTL_DID1_PRTNO_1133  0x00C30000  // LM3S1133
#define SYSCTL_DID1_PRTNO_1138  0x00C50000  // LM3S1138
#define SYSCTL_DID1_PRTNO_1150  0x00C10000  // LM3S1150
#define SYSCTL_DID1_PRTNO_1162  0x00C40000  // LM3S1162
#define SYSCTL_DID1_PRTNO_1165  0x00C20000  // LM3S1165
#define SYSCTL_DID1_PRTNO_1166  0x00EC0000  // LM3S1166
#define SYSCTL_DID1_PRTNO_1332  0x00C60000  // LM3S1332
#define SYSCTL_DID1_PRTNO_1435  0x00BC0000  // LM3S1435
#define SYSCTL_DID1_PRTNO_1439  0x00BA0000  // LM3S1439
#define SYSCTL_DID1_PRTNO_1512  0x00BB0000  // LM3S1512
#define SYSCTL_DID1_PRTNO_1538  0x00C70000  // LM3S1538
#define SYSCTL_DID1_PRTNO_1601  0x00DB0000  // LM3S1601
#define SYSCTL_DID1_PRTNO_1607  0x00060000  // LM3S1607
#define SYSCTL_DID1_PRTNO_1608  0x00DA0000  // LM3S1608
#define SYSCTL_DID1_PRTNO_1620  0x00C00000  // LM3S1620
#define SYSCTL_DID1_PRTNO_1621  0x00CD0000  // LM3S1621
#define SYSCTL_DID1_PRTNO_1625  0x00030000  // LM3S1625
#define SYSCTL_DID1_PRTNO_1626  0x00040000  // LM3S1626
#define SYSCTL_DID1_PRTNO_1627  0x00050000  // LM3S1627
#define SYSCTL_DID1_PRTNO_1635  0x00B30000  // LM3S1635
#define SYSCTL_DID1_PRTNO_1636  0x00EB0000  // LM3S1636
#define SYSCTL_DID1_PRTNO_1637  0x00BD0000  // LM3S1637
#define SYSCTL_DID1_PRTNO_1651  0x00B10000  // LM3S1651
#define SYSCTL_DID1_PRTNO_1751  0x00B90000  // LM3S1751
#define SYSCTL_DID1_PRTNO_1776  0x00100000  // LM3S1776
#define SYSCTL_DID1_PRTNO_1811  0x00160000  // LM3S1811
#define SYSCTL_DID1_PRTNO_1816  0x003D0000  // LM3S1816
#define SYSCTL_DID1_PRTNO_1850  0x00B40000  // LM3S1850
#define SYSCTL_DID1_PRTNO_1911  0x00DD0000  // LM3S1911
#define SYSCTL_DID1_PRTNO_1918  0x00DC0000  // LM3S1918
#define SYSCTL_DID1_PRTNO_1937  0x00B70000  // LM3S1937
#define SYSCTL_DID1_PRTNO_1958  0x00BE0000  // LM3S1958
#define SYSCTL_DID1_PRTNO_1960  0x00B50000  // LM3S1960
#define SYSCTL_DID1_PRTNO_1968  0x00B80000  // LM3S1968
#define SYSCTL_DID1_PRTNO_1969  0x00EA0000  // LM3S1969
#define SYSCTL_DID1_PRTNO_1B21  0x00CE0000  // LM3S1B21
#define SYSCTL_DID1_PRTNO_1C21  0x00CA0000  // LM3S1C21
#define SYSCTL_DID1_PRTNO_1C26  0x00CB0000  // LM3S1C26
#define SYSCTL_DID1_PRTNO_1C58  0x00980000  // LM3S1C58
#define SYSCTL_DID1_PRTNO_1D21  0x00B00000  // LM3S1D21
#define SYSCTL_DID1_PRTNO_1D26  0x00CC0000  // LM3S1D26
#define SYSCTL_DID1_PRTNO_1F11  0x001D0000  // LM3S1F11
#define SYSCTL_DID1_PRTNO_1F16  0x001B0000  // LM3S1F16
#define SYSCTL_DID1_PRTNO_1G21  0x00AF0000  // LM3S1G21
#define SYSCTL_DID1_PRTNO_1G58  0x00950000  // LM3S1G58
#define SYSCTL_DID1_PRTNO_1H11  0x001E0000  // LM3S1H11
#define SYSCTL_DID1_PRTNO_1H16  0x001C0000  // LM3S1H16
#define SYSCTL_DID1_PRTNO_1J11  0x000F0000  // LM3S1J11
#define SYSCTL_DID1_PRTNO_1J16  0x003C0000  // LM3S1J16
#define SYSCTL_DID1_PRTNO_1N11  0x000E0000  // LM3S1N11
#define SYSCTL_DID1_PRTNO_1N16  0x003B0000  // LM3S1N16
#define SYSCTL_DID1_PRTNO_1P51  0x00B20000  // LM3S1P51
#define SYSCTL_DID1_PRTNO_1R21  0x009E0000  // LM3S1R21
#define SYSCTL_DID1_PRTNO_1R26  0x00C90000  // LM3S1R26
#define SYSCTL_DID1_PRTNO_1W16  0x00300000  // LM3S1W16
#define SYSCTL_DID1_PRTNO_1Z16  0x002F0000  // LM3S1Z16
#define SYSCTL_DID1_PRTNO_2016  0x00D40000  // LM3S2016
#define SYSCTL_DID1_PRTNO_2110  0x00510000  // LM3S2110
#define SYSCTL_DID1_PRTNO_2139  0x00840000  // LM3S2139
#define SYSCTL_DID1_PRTNO_2276  0x00390000  // LM3S2276
#define SYSCTL_DID1_PRTNO_2410  0x00A20000  // LM3S2410
#define SYSCTL_DID1_PRTNO_2412  0x00590000  // LM3S2412
#define SYSCTL_DID1_PRTNO_2432  0x00560000  // LM3S2432
#define SYSCTL_DID1_PRTNO_2533  0x005A0000  // LM3S2533
#define SYSCTL_DID1_PRTNO_2601  0x00E10000  // LM3S2601
#define SYSCTL_DID1_PRTNO_2608  0x00E00000  // LM3S2608
#define SYSCTL_DID1_PRTNO_2616  0x00330000  // LM3S2616
#define SYSCTL_DID1_PRTNO_2620  0x00570000  // LM3S2620
#define SYSCTL_DID1_PRTNO_2637  0x00850000  // LM3S2637
#define SYSCTL_DID1_PRTNO_2651  0x00530000  // LM3S2651
#define SYSCTL_DID1_PRTNO_2671  0x00800000  // LM3S2671
#define SYSCTL_DID1_PRTNO_2678  0x00500000  // LM3S2678
#define SYSCTL_DID1_PRTNO_2730  0x00A40000  // LM3S2730
#define SYSCTL_DID1_PRTNO_2739  0x00520000  // LM3S2739
#define SYSCTL_DID1_PRTNO_2776  0x003A0000  // LM3S2776
#define SYSCTL_DID1_PRTNO_2793  0x006D0000  // LM3S2793
#define SYSCTL_DID1_PRTNO_2911  0x00E30000  // LM3S2911
#define SYSCTL_DID1_PRTNO_2918  0x00E20000  // LM3S2918
#define SYSCTL_DID1_PRTNO_2919  0x00ED0000  // LM3S2919
#define SYSCTL_DID1_PRTNO_2939  0x00540000  // LM3S2939
#define SYSCTL_DID1_PRTNO_2948  0x008F0000  // LM3S2948
#define SYSCTL_DID1_PRTNO_2950  0x00580000  // LM3S2950
#define SYSCTL_DID1_PRTNO_2965  0x00550000  // LM3S2965
#define SYSCTL_DID1_PRTNO_2B93  0x006C0000  // LM3S2B93
#define SYSCTL_DID1_PRTNO_2D93  0x00940000  // LM3S2D93
#define SYSCTL_DID1_PRTNO_2U93  0x00930000  // LM3S2U93
#define SYSCTL_DID1_PRTNO_3634  0x00080000  // LM3S3634
#define SYSCTL_DID1_PRTNO_3651  0x00430000  // LM3S3651
#define SYSCTL_DID1_PRTNO_3654  0x00C80000  // LM3S3654
#define SYSCTL_DID1_PRTNO_3739  0x00440000  // LM3S3739
#define SYSCTL_DID1_PRTNO_3748  0x00490000  // LM3S3748
#define SYSCTL_DID1_PRTNO_3749  0x00450000  // LM3S3749
#define SYSCTL_DID1_PRTNO_3826  0x00420000  // LM3S3826
#define SYSCTL_DID1_PRTNO_3J26  0x00410000  // LM3S3J26
#define SYSCTL_DID1_PRTNO_3N26  0x00400000  // LM3S3N26
#define SYSCTL_DID1_PRTNO_3W26  0x003F0000  // LM3S3W26
#define SYSCTL_DID1_PRTNO_3Z26  0x003E0000  // LM3S3Z26
#define SYSCTL_DID1_PRTNO_5632  0x00810000  // LM3S5632
#define SYSCTL_DID1_PRTNO_5651  0x000C0000  // LM3S5651
#define SYSCTL_DID1_PRTNO_5652  0x008A0000  // LM3S5652
#define SYSCTL_DID1_PRTNO_5656  0x004D0000  // LM3S5656
#define SYSCTL_DID1_PRTNO_5662  0x00910000  // LM3S5662
#define SYSCTL_DID1_PRTNO_5732  0x00960000  // LM3S5732
#define SYSCTL_DID1_PRTNO_5737  0x00970000  // LM3S5737
#define SYSCTL_DID1_PRTNO_5739  0x00A00000  // LM3S5739
#define SYSCTL_DID1_PRTNO_5747  0x00990000  // LM3S5747
#define SYSCTL_DID1_PRTNO_5749  0x00A70000  // LM3S5749
#define SYSCTL_DID1_PRTNO_5752  0x009A0000  // LM3S5752
#define SYSCTL_DID1_PRTNO_5762  0x009C0000  // LM3S5762
#define SYSCTL_DID1_PRTNO_5791  0x00690000  // LM3S5791
#define SYSCTL_DID1_PRTNO_5951  0x000B0000  // LM3S5951
#define SYSCTL_DID1_PRTNO_5956  0x004E0000  // LM3S5956
#define SYSCTL_DID1_PRTNO_5B91  0x00680000  // LM3S5B91
#define SYSCTL_DID1_PRTNO_5C31  0x002E0000  // LM3S5C31
#define SYSCTL_DID1_PRTNO_5C36  0x002C0000  // LM3S5C36
#define SYSCTL_DID1_PRTNO_5C51  0x005E0000  // LM3S5C51
#define SYSCTL_DID1_PRTNO_5C56  0x005B0000  // LM3S5C56
#define SYSCTL_DID1_PRTNO_5D51  0x005F0000  // LM3S5D51
#define SYSCTL_DID1_PRTNO_5D56  0x005C0000  // LM3S5D56
#define SYSCTL_DID1_PRTNO_5D91  0x00870000  // LM3S5D91
#define SYSCTL_DID1_PRTNO_5G31  0x002D0000  // LM3S5G31
#define SYSCTL_DID1_PRTNO_5G36  0x001F0000  // LM3S5G36
#define SYSCTL_DID1_PRTNO_5G51  0x005D0000  // LM3S5G51
#define SYSCTL_DID1_PRTNO_5G56  0x004F0000  // LM3S5G56
#define SYSCTL_DID1_PRTNO_5K31  0x00090000  // LM3S5K31
#define SYSCTL_DID1_PRTNO_5K36  0x004A0000  // LM3S5K36
#define SYSCTL_DID1_PRTNO_5P31  0x000A0000  // LM3S5P31
#define SYSCTL_DID1_PRTNO_5P36  0x00480000  // LM3S5P36
#define SYSCTL_DID1_PRTNO_5P3B  0x00B60000  // LM3S5P3B
#define SYSCTL_DID1_PRTNO_5P51  0x000D0000  // LM3S5P51
#define SYSCTL_DID1_PRTNO_5P56  0x004C0000  // LM3S5P56
#define SYSCTL_DID1_PRTNO_5R31  0x00070000  // LM3S5R31
#define SYSCTL_DID1_PRTNO_5R36  0x004B0000  // LM3S5R36
#define SYSCTL_DID1_PRTNO_5T36  0x00470000  // LM3S5T36
#define SYSCTL_DID1_PRTNO_5U91  0x007F0000  // LM3S5U91
#define SYSCTL_DID1_PRTNO_5Y36  0x00460000  // LM3S5Y36
#define SYSCTL_DID1_PRTNO_6100  0x00A10000  // LM3S6100
#define SYSCTL_DID1_PRTNO_6110  0x00740000  // LM3S6110
#define SYSCTL_DID1_PRTNO_6420  0x00A50000  // LM3S6420
#define SYSCTL_DID1_PRTNO_6422  0x00820000  // LM3S6422
#define SYSCTL_DID1_PRTNO_6432  0x00750000  // LM3S6432
#define SYSCTL_DID1_PRTNO_6537  0x00760000  // LM3S6537
#define SYSCTL_DID1_PRTNO_6610  0x00710000  // LM3S6610
#define SYSCTL_DID1_PRTNO_6611  0x00E70000  // LM3S6611
#define SYSCTL_DID1_PRTNO_6618  0x00E60000  // LM3S6618
#define SYSCTL_DID1_PRTNO_6633  0x00830000  // LM3S6633
#define SYSCTL_DID1_PRTNO_6637  0x008B0000  // LM3S6637
#define SYSCTL_DID1_PRTNO_6730  0x00A30000  // LM3S6730
#define SYSCTL_DID1_PRTNO_6753  0x00770000  // LM3S6753
#define SYSCTL_DID1_PRTNO_6816  0x00D10000  // LM3S6816
#define SYSCTL_DID1_PRTNO_6911  0x00E90000  // LM3S6911
#define SYSCTL_DID1_PRTNO_6916  0x00D30000  // LM3S6916
#define SYSCTL_DID1_PRTNO_6918  0x00E80000  // LM3S6918
#define SYSCTL_DID1_PRTNO_6938  0x00890000  // LM3S6938
#define SYSCTL_DID1_PRTNO_6950  0x00720000  // LM3S6950
#define SYSCTL_DID1_PRTNO_6952  0x00780000  // LM3S6952
#define SYSCTL_DID1_PRTNO_6965  0x00730000  // LM3S6965
#define SYSCTL_DID1_PRTNO_6C11  0x00AA0000  // LM3S6C11
#define SYSCTL_DID1_PRTNO_6C65  0x00AC0000  // LM3S6C65
#define SYSCTL_DID1_PRTNO_6G11  0x009F0000  // LM3S6G11
#define SYSCTL_DID1_PRTNO_6G65  0x00AB0000  // LM3S6G65
#define SYSCTL_DID1_PRTNO_8530  0x00640000  // LM3S8530
#define SYSCTL_DID1_PRTNO_8538  0x008E0000  // LM3S8538
#define SYSCTL_DID1_PRTNO_8630  0x00610000  // LM3S8630
#define SYSCTL_DID1_PRTNO_8730  0x00630000  // LM3S8730
#define SYSCTL_DID1_PRTNO_8733  0x008D0000  // LM3S8733
#define SYSCTL_DID1_PRTNO_8738  0x00860000  // LM3S8738
#define SYSCTL_DID1_PRTNO_8930  0x00650000  // LM3S8930
#define SYSCTL_DID1_PRTNO_8933  0x008C0000  // LM3S8933
#define SYSCTL_DID1_PRTNO_8938  0x00880000  // LM3S8938
#define SYSCTL_DID1_PRTNO_8962  0x00A60000  // LM3S8962
#define SYSCTL_DID1_PRTNO_8970  0x00620000  // LM3S8970
#define SYSCTL_DID1_PRTNO_8971  0x00D70000  // LM3S8971
#define SYSCTL_DID1_PRTNO_8C62  0x00AE0000  // LM3S8C62
#define SYSCTL_DID1_PRTNO_8G62  0x00AD0000  // LM3S8G62
#define SYSCTL_DID1_PRTNO_9781  0x00CF0000  // LM3S9781
#define SYSCTL_DID1_PRTNO_9790  0x00670000  // LM3S9790
#define SYSCTL_DID1_PRTNO_9792  0x006B0000  // LM3S9792
#define SYSCTL_DID1_PRTNO_9971  0x002D0000  // LM3S9971
#define SYSCTL_DID1_PRTNO_9997  0x00200000  // LM3S9997
#define SYSCTL_DID1_PRTNO_9B81  0x00D00000  // LM3S9B81
#define SYSCTL_DID1_PRTNO_9B90  0x00660000  // LM3S9B90
#define SYSCTL_DID1_PRTNO_9B92  0x006A0000  // LM3S9B92
#define SYSCTL_DID1_PRTNO_9B95  0x006E0000  // LM3S9B95
#define SYSCTL_DID1_PRTNO_9B96  0x006F0000  // LM3S9B96
#define SYSCTL_DID1_PRTNO_9BN2  0x001D0000  // LM3S9BN2
#define SYSCTL_DID1_PRTNO_9BN5  0x001E0000  // LM3S9BN5
#define SYSCTL_DID1_PRTNO_9BN6  0x001F0000  // LM3S9BN6
#define SYSCTL_DID1_PRTNO_9C97  0x00700000  // LM3S9C97
#define SYSCTL_DID1_PRTNO_9CN5  0x007A0000  // LM3S9CN5
#define SYSCTL_DID1_PRTNO_9D81  0x00A90000  // LM3S9D81
#define SYSCTL_DID1_PRTNO_9D90  0x007E0000  // LM3S9D90
#define SYSCTL_DID1_PRTNO_9D92  0x00920000  // LM3S9D92
#define SYSCTL_DID1_PRTNO_9D95  0x00C80000  // LM3S9D95
#define SYSCTL_DID1_PRTNO_9D96  0x009D0000  // LM3S9D96
#define SYSCTL_DID1_PRTNO_9DN5  0x007B0000  // LM3S9DN5
#define SYSCTL_DID1_PRTNO_9DN6  0x007C0000  // LM3S9DN6
#define SYSCTL_DID1_PRTNO_9G97  0x00600000  // LM3S9G97
#define SYSCTL_DID1_PRTNO_9GN5  0x00790000  // LM3S9GN5
#define SYSCTL_DID1_PRTNO_9L71  0x001B0000  // LM3S9L71
#define SYSCTL_DID1_PRTNO_9L97  0x00180000  // LM3S9L97
#define SYSCTL_DID1_PRTNO_9U81  0x00A80000  // LM3S9U81
#define SYSCTL_DID1_PRTNO_9U90  0x007D0000  // LM3S9U90
#define SYSCTL_DID1_PRTNO_9U92  0x00900000  // LM3S9U92
#define SYSCTL_DID1_PRTNO_9U95  0x00B70000  // LM3S9U95
#define SYSCTL_DID1_PRTNO_9U96  0x009B0000  // LM3S9U96
#define SYSCTL_DID1_PRTNO_LM4F110B2QR \
                                0x00180000  // LM4F110B2QR
#define SYSCTL_DID1_PRTNO_LM4F110C4QR \
                                0x00190000  // LM4F110C4QR
#define SYSCTL_DID1_PRTNO_LM4F110E5QR \
                                0x00100000  // LM4F110E5QR
#define SYSCTL_DID1_PRTNO_LM4F110H5QR \
                                0x00110000  // LM4F110H5QR
#define SYSCTL_DID1_PRTNO_LM4F111B2QR \
                                0x00220000  // LM4F111B2QR
#define SYSCTL_DID1_PRTNO_LM4F111C4QR \
                                0x00230000  // LM4F111C4QR
#define SYSCTL_DID1_PRTNO_LM4F111E5QR \
                                0x00200000  // LM4F111E5QR
#define SYSCTL_DID1_PRTNO_LM4F111H5QR \
                                0x00210000  // LM4F111H5QR
#define SYSCTL_DID1_PRTNO_LM4F112C4QC \
                                0x00360000  // LM4F112C4QC
#define SYSCTL_DID1_PRTNO_LM4F112E5QC \
                                0x00300000  // LM4F112E5QC
#define SYSCTL_DID1_PRTNO_LM4F112H5QC \
                                0x00310000  // LM4F112H5QC
#define SYSCTL_DID1_PRTNO_LM4F112H5QD \
                                0x00350000  // LM4F112H5QD
#define SYSCTL_DID1_PRTNO_LM4F120B2QR \
                                0x00010000  // LM4F120B2QR
#define SYSCTL_DID1_PRTNO_LM4F120C4QR \
                                0x00020000  // LM4F120C4QR
#define SYSCTL_DID1_PRTNO_LM4F120E5QR \
                                0x00030000  // LM4F120E5QR
#define SYSCTL_DID1_PRTNO_LM4F120H5QR \
                                0x00040000  // LM4F120H5QR
#define SYSCTL_DID1_PRTNO_LM4F121B2QR \
                                0x00080000  // LM4F121B2QR
#define SYSCTL_DID1_PRTNO_LM4F121C4QR \
                                0x00090000  // LM4F121C4QR
#define SYSCTL_DID1_PRTNO_LM4F121E5QR \
                                0x000A0000  // LM4F121E5QR
#define SYSCTL_DID1_PRTNO_LM4F121H5QR \
                                0x000B0000  // LM4F121H5QR
#define SYSCTL_DID1_PRTNO_LM4F122C4QC \
                                0x00D00000  // LM4F122C4QC
#define SYSCTL_DID1_PRTNO_LM4F122E5QC \
                                0x00D10000  // LM4F122E5QC
#define SYSCTL_DID1_PRTNO_LM4F122H5QC \
                                0x00D20000  // LM4F122H5QC
#define SYSCTL_DID1_PRTNO_LM4F122H5QD \
                                0x00D60000  // LM4F122H5QD
#define SYSCTL_DID1_PRTNO_LM4F130C4QR \
                                0x00480000  // LM4F130C4QR
#define SYSCTL_DID1_PRTNO_LM4F130E5QR \
                                0x00400000  // LM4F130E5QR
#define SYSCTL_DID1_PRTNO_LM4F130H5QR \
                                0x00410000  // LM4F130H5QR
#define SYSCTL_DID1_PRTNO_LM4F131C4QR \
                                0x00520000  // LM4F131C4QR
#define SYSCTL_DID1_PRTNO_LM4F131E5QR \
                                0x00500000  // LM4F131E5QR
#define SYSCTL_DID1_PRTNO_LM4F131H5QR \
                                0x00510000  // LM4F131H5QR
#define SYSCTL_DID1_PRTNO_LM4F132C4QC \
                                0x00660000  // LM4F132C4QC
#define SYSCTL_DID1_PRTNO_LM4F132E5QC \
                                0x00600000  // LM4F132E5QC
#define SYSCTL_DID1_PRTNO_LM4F132H5QC \
                                0x00610000  // LM4F132H5QC
#define SYSCTL_DID1_PRTNO_LM4F132H5QD \
                                0x00650000  // LM4F132H5QD
#define SYSCTL_DID1_PRTNO_LM4F230E5QR \
                                0x00A00000  // LM4F230E5QR
#define SYSCTL_DID1_PRTNO_LM4F230H5QR \
                                0x00A10000  // LM4F230H5QR
#define SYSCTL_DID1_PRTNO_LM4F231E5QR \
                                0x00B00000  // LM4F231E5QR
#define SYSCTL_DID1_PRTNO_LM4F231H5QR \
                                0x00B10000  // LM4F231H5QR
#define SYSCTL_DID1_PRTNO_LM4F232E5QC \
                                0x00C00000  // LM4F232E5QC
#define SYSCTL_DID1_PRTNO_LM4F232H5BB \
                                0x00E30000  // LM4F232H5BB
#define SYSCTL_DID1_PRTNO_LM4F232H5QC \
                                0x00C10000  // LM4F232H5QC
#define SYSCTL_DID1_PRTNO_LM4F232H5QD \
                                0x00C50000  // LM4F232H5QD
#define SYSCTL_DID1_PRTNO_LM4FS1AH5BB \
                                0x00E50000  // LM4FS1AH5BB
#define SYSCTL_DID1_PRTNO_LM4FS99H5BB \
                                0x00E40000  // LM4FS99H5BB
#define SYSCTL_DID1_PRTNO_LM4FSXAH5BB \
                                0x00E00000  // LM4FSXAH5BB
#define SYSCTL_DID1_PINCNT_M    0x0000E000  // Package Pin Count
#define SYSCTL_DID1_PINCNT_28   0x00000000  // 28 pin package
#define SYSCTL_DID1_PINCNT_48   0x00002000  // 48-pin package
#define SYSCTL_DID1_PINCNT_100  0x00004000  // 100-pin package
#define SYSCTL_DID1_PINCNT_64   0x00006000  // 64-pin package
#define SYSCTL_DID1_PINCNT_144  0x00008000  // 144-pin package
#define SYSCTL_DID1_PINCNT_157  0x0000A000  // 157-pin package
#define SYSCTL_DID1_TEMP_M      0x000000E0  // Temperature Range
#define SYSCTL_DID1_TEMP_C      0x00000000  // Commercial temperature range (0C
                                            // to 70C)
#define SYSCTL_DID1_TEMP_I      0x00000020  // Industrial temperature range
                                            // (-40C to 85C)
#define SYSCTL_DID1_TEMP_E      0x00000040  // Extended temperature range (-40C
                                            // to 105C)
#define SYSCTL_DID1_PKG_M       0x00000018  // Package Type
#define SYSCTL_DID1_PKG_SOIC    0x00000000  // SOIC package
#define SYSCTL_DID1_PKG_QFP     0x00000008  // LQFP package
#define SYSCTL_DID1_PKG_BGA     0x00000010  // BGA package
#define SYSCTL_DID1_PKG_QFN     0x00000018  // QFN package
#define SYSCTL_DID1_ROHS        0x00000004  // RoHS-Compliance
#define SYSCTL_DID1_QUAL_M      0x00000003  // Qualification Status
#define SYSCTL_DID1_QUAL_ES     0x00000000  // Engineering Sample (unqualified)
#define SYSCTL_DID1_QUAL_PP     0x00000001  // Pilot Production (unqualified)
#define SYSCTL_DID1_QUAL_FQ     0x00000002  // Fully Qualified
#define SYSCTL_DID1_PRTNO_S     16          // Part number shift

